#ifndef GLOBAL_CONSTANTS_H
#define GLOBAL_CONSTANTS_H


const int BRICKS_X = 10;            //-колво клеток горизонтально
const int BRICKS_Y = 20;            //-колво клеток вертикально

const int PW_START_X = 20;            //-начало прямоугольника стакана х
const int PW_START_Y = 20;            //-начало прямоугольника стакана y

const int PW_FRAME_THICKNESS = 2;  //-толщина внешней рамки
const int PW_FRAME_PADDING = 3;    //-пиксели между рамкой и внутри

const int PW_BRICK_SIZE = 10;        //-размер клетки в пикселях
const int PW_BRICK_PADDING = 2;     //-расстояние между клетками в пх

const bool FAKE_MATRIX[BRICKS_X][BRICKS_Y] =
{
				/*top left*/
				{1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0,},
				{0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,},
				{0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,},
				{0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,},
				{0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,},
				{0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,},
				{0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,},
				{0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,},
				{0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,},
				{1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,},
};                                              /*right bottom*/

const bool PIECE_T[3][2] =
{
				{1, 0},
				{1, 1},
				{1, 0},
};

#endif // GLOBAL_CONSTANTS_H
